Repository: NMarjou/localization-app
Catalog: TMs/en-US_th-TH.tmx
Source language: en_us
Languages: th_th

source: A Performance Management feature that enables HRBP administrators to create career development plans in which workers and managers reflect on the events that took place over a defined period of time.
th_th: ฟีเจอร์การบริหารผลการปฏิบัติงานที่ช่วยให้ผู้ดูแลระบบ HRBP สามารถสร้างแผนพัฒนาสายอาชีพ ซึ่งพนักงานและผู้จัดการสามารถทบทวนเหตุการณ์ต่าง ๆ ที่เกิดขึ้นในช่วงระยะเวลาที่กำหนด

source: Enable career development
th_th: เปิดใช้งานการพัฒนาอาชีพ

source: General career development settings
th_th: การตั้งค่าทั่วไปสำหรับการพัฒนาอาชีพ

source: Career Development Settings
th_th: การตั้งค่าการพัฒนาอาชีพ

source: Check-In Mass Assignment
th_th: การมอบหมายงการเช็คอินจำนวนมาก

source: Check-in deletion
th_th: การลบการเช็คอิน

source: Enable check-ins
th_th: เปิดใช้งานการเช็คอิน

source: A Performance Management feature that enables workers to schedule regular discussions with their managers and reports to align on goals.
th_th: ฟีเจอร์การบริหารผลงานที่ช่วยให้พนักงานสามารถนัดหมายพูดคุยกับผู้จัดการและผู้ใต้บังคับบัญชาเป็นประจำ เพื่อปรับเป้าหมายให้สอดคล้องกัน

source: General check-ins settings
th_th: การตั้งค่าทั่วไปสำหรับการเช็คอิน

source: Allow managers to conduct structured discussions with their direct reports. Using dedicated widgets, they can comment on areas such as performance, goals, and behaviors. Once finalized, workers can review comments and either accept the check-in, or propose a follow-up meeting directly from the check-in page.
th_th: อนุญาตให้ผู้จัดการดำเนินการสนทนาอย่างมีโครงสร้างกับรายงานโดยตรงของพวกเขา โดยใช้วิดเจ็ตเฉพาะ พวกเขาสามารถแสดงความคิดเห็นในด้านต่างๆ เช่น ประสิทธิภาพ เป้าหมาย และพฤติกรรม เมื่อเสร็จสิ้น พนักงานสามารถตรวจสอบความคิดเห็นและยอมรับการเช็คอิน หรือเสนอการประชุมติดตามผลโดยตรงจากหน้าการเช็คอิน

source: Allow workers and managers to schedule and structure check-ins at their convenience. These sessions support adding and editing content or comments as needed, with all information visible only to the participants.
th_th: อนุญาตให้พนักงานและผู้จัดการสามารถกำหนดเวลาและโครงสร้างการเช็คอินได้ตามความสะดวกของพวกเขา เซสชันเหล่านี้รองรับการเพิ่มและแก้ไขเนื้อหาหรือความคิดเห็นตามที่ต้องการ โดยข้อมูลทั้งหมดจะมองเห็นได้เฉพาะผู้เข้าร่วมเท่านั้น

source: Enable regular check-ins
th_th: เปิดใช้งานการเช็คอินเป็นประจำ

source: Check-In Settings
th_th: การตั้งค่าการเช็คอิน

source: Create communication round
th_th: สร้างรอบการสื่อสาร

source: The latest document generations will appear here.<br/>Check again later for updates or explore more features in the meantime.
th_th: รุ่นเอกสารล่าสุดจะแสดงที่นี่<br/>โปรดตรวจสอบอีกครั้งในภายหลังเพื่อดูการอัปเดต หรือสำรวจฟีเจอร์เพิ่มเติมในระหว่างนี้

source: Document generation
th_th: การสร้างเอกสาร

source: Explore the latest document generations.
th_th: สำรวจการสร้างเอกสารล่าสุด

source: Export log details
th_th: ส่งออกรายละเอียดบันทึก

source: Completion
th_th: เสร็จสมบูรณ์

source: Document template
th_th: แม่แบบเอกสาร

source: Errors
th_th: ข้อผิดพลาด

source: Generated documents
th_th: เอกสารที่สร้างขึ้น

source: Imported documents
th_th: เอกสารที่นำเข้า

source: Requester
th_th: ผู้ร้องขอ

source: Completed with errors
th_th: เสร็จสิ้นพร้อมข้อผิดพลาด

source: Pending
th_th: รอดำเนินการ

source: No file uploaded
th_th: ไม่มีไฟล์ที่อัปโหลด

source: Supported file formats: DOCX. Maximum file size: 10MB. Maximum number of files per upload: 1 file.
th_th: รูปแบบไฟล์ที่รองรับ: DOCX ขนาดไฟล์สูงสุด: 10MB จำนวนไฟล์สูงสุดต่อการอัปโหลด: 1 ไฟล์

source: The document "{{fileName}}" cannot be imported. Make sure it matches the format and size requirements.
th_th: ไม่สามารถนำเข้าเอกสาร "{{fileName}}" ได้ กรุณาตรวจสอบว่าเอกสารตรงตามข้อกำหนดด้านรูปแบบและขนาด

source: The code must be unique to publish the document template. Please change the code and try again.
th_th: รหัสต้องไม่ซ้ำกันเพื่อเผยแพร่แม่แบบเอกสาร กรุณาเปลี่ยนรหัสและลองใหม่อีกครั้ง

source: Create document template
th_th: สร้างแม่แบบเอกสาร

source: Edit document template
th_th: แก้ไขแม่แบบเอกสาร

source: Create a document to get started
th_th: สร้างเอกสารเพื่อเริ่มต้น

source: No documents available
th_th: ไม่มีเอกสารที่พร้อมใช้งาน

source: Failed to retrieve the document template file.
th_th: ไม่สามารถดึงไฟล์แม่แบบเอกสารได้

source: Failed to retrieve the document template
th_th: ไม่สามารถดึงเทมเพลตเอกสารได้

source: The document file is not available.
th_th: ไม่พบไฟล์เอกสาร

source: Include an overview
th_th: รวมภาพรวม

source: Document template details
th_th: รายละเอียดแม่แบบเอกสาร

source: Define your document template
th_th: กำหนดแม่แบบเอกสารของคุณ

source: Preview a PDF document generated from the template and variables.
th_th: ดูตัวอย่างเอกสาร PDF ที่สร้างจากเทมเพลตและตัวแปร

source: Document Templates
th_th: แม่แบบเอกสาร

source: Template history
th_th: ประวัติเทมเพลต

source: Back to document template list
th_th: กลับไปยังรายการแม่แบบเอกสาร

source: Template document
th_th: เอกสารแม่แบบ

source: See the history of the template .docx file since it was published.
th_th: ดูประวัติของไฟล์เทมเพลต .docx ตั้งแต่มีการเผยแพร่

source: Template "{{name}}" history
th_th: ประวัติของเทมเพลต "{{name}}"

source: Uploaded by
th_th: อัปโหลดโดย

source: Edit variables in the preview. Need help? Use our template to get started.
th_th: แก้ไขตัวแปรในตัวอย่างแสดงตัวอย่าง ต้องการความช่วยเหลือหรือไม่? ใช้เทมเพลตของเราเพื่อเริ่มต้น

source: Preview variables
th_th: ดูตัวแปรล่วงหน้า

source: Changes were detected in the fields above. Click "Preview document" to generate the updated document.
th_th: ตรวจพบการเปลี่ยนแปลงในช่องข้อมูลด้านบน กรุณาคลิก "แสดงตัวอย่างเอกสาร" เพื่อสร้างเอกสารที่อัปเดตแล้ว

source: Invalid JSON format
th_th: รูปแบบ JSON ไม่ถูกต้อง

source: ESC – exit editor, Tab – create an indent
th_th: ESC – ออกจากตัวแก้ไข, Tab – สร้างการเยื้อง

source: Keyboard shortcuts:
th_th: ปุ่มลัดแป้นพิมพ์:

source: JSON editor
th_th: ตัวแก้ไข JSON

source: Something went wrong. Please check that your JSON or uploaded document is valid.
th_th: เกิดข้อผิดพลาด กรุณาตรวจสอบว่า JSON หรือเอกสารที่อัปโหลดของท่านถูกต้องหรือไม่

source: You haven't uploaded a document yet. Return to the previous step to upload a document.
th_th: คุณยังไม่ได้อัปโหลดเอกสาร กรุณากลับไปยังขั้นตอนก่อนหน้าเพื่ออัปโหลดเอกสาร

source: Preview document
th_th: ดูตัวอย่างเอกสาร

source: Use example
th_th: ใช้ตัวอย่าง

source: The document template was successfully published.
th_th: เผยแพร่แม่แบบเอกสารเรียบร้อยแล้ว

source: The document template was successfully saved.
th_th: บันทึกแม่แบบเอกสารเรียบร้อยแล้ว

source: Create and manage document templates
th_th: สร้างและจัดการแม่แบบเอกสาร

source: View document template
th_th: ดูเทมเพลตเอกสาร

source: Configure the text value used to replace average compensation values when the underlying population count does not meet the threshold.
th_th: กำหนดค่าข้อความที่จะใช้แทนค่าชดเชยเฉลี่ย เมื่อจำนวนบุคลากรที่เกี่ยวข้องไม่ถึงเกณฑ์ขั้นต่ำ

source: Anonymization placeholder text
th_th: ข้อความแทนที่สำหรับการไม่เปิดเผยตัวตน

source: Enable anonymization
th_th: เปิดใช้งานการไม่เปิดเผยตัวตน

source: Enable anonymization and define the minimum number of workers required in a population (All, Male, or Female) for average values to be displayed.
th_th: เปิดใช้งานการไม่เปิดเผยตัวตนและกำหนดจำนวนขั้นต่ำของพนักงานที่ต้องมีในกลุ่ม (ทั้งหมด ผู้ชาย หรือผู้หญิง) เพื่อให้ค่าเฉลี่ยถูกแสดงผล

source: API import
th_th: นำเข้า API

source: Enable this option to allow the creation of pay information requests via API.
th_th: เปิดใช้งานตัวเลือกนี้เพื่ออนุญาตให้สร้างคำขอข้อมูลค่าจ้างผ่าน API

source: Enable document generation
th_th: เปิดใช้งานการสร้างเอกสาร

source: Enable this feature to allow document generation.
th_th: เปิดใช้งานฟีเจอร์นี้เพื่ออนุญาตให้สร้างเอกสาร

source: Enable this feature to distribute documents to workers.
th_th: เปิดใช้งานฟีเจอร์นี้เพื่อแจกจ่ายเอกสารให้กับพนักงาน

source: Enable this option to allow HRPBs to create pay information requests.
th_th: เปิดใช้ตัวเลือกนี้เพื่อให้ HRPB สามารถสร้างคำขอข้อมูลเงินเดือนได้

source: Enable overdue period
th_th: เปิดใช้งานช่วงเวลาค้างชำระ

source: Enable this feature to highlight the information requests which exceed the resolution deadline.
th_th: เปิดใช้ฟีเจอร์นี้เพื่อเน้นคำขอข้อมูลที่เกินกำหนดแก้ไข

source: Enable pay information requests
th_th: เปิดใช้งานการขอข้อมูลเงินเดือน

source: Enable this feature to manage pay information requests.
th_th: เปิดใช้งานฟีเจอร์นี้เพื่อจัดการคำขอข้อมูลเงินเดือน

source: Enable warning period
th_th: เปิดใช้งานช่วงเวลาเตือน

source: Enable this feature to highlight the information requests that are approaching the resolution deadline.
th_th: เปิดใช้งานฟีเจอร์นี้เพื่อไฮไลต์คำขอข้อมูลที่กำลังใกล้ถึงกำหนดการแก้ไขปัญหา

source: Enable this feature to allow workers to request pay information.
th_th: เปิดใช้งานคุณลักษณะนี้เพื่อให้พนักงานสามารถขอข้อมูลค่าจ้างได้

source: The value must be between 1 and 365.
th_th: ค่าต้องอยู่ระหว่าง 1 ถึง 365.

source: The overdue period must be greater than the warning period.
th_th: ช่วงเวลาค้างชำระต้องมากกว่าช่วงเวลาเตือน

source: If OverduePeriod is disabled, then OverduePeriodInDays must be null.
th_th: หากปิดการใช้งาน OverduePeriod แล้ว OverduePeriodInDays ต้องเป็นค่า null

source: If WarningPeriod is disabled, then WarningPeriodInDays must be null.
th_th: หากปิดใช้ WarningPeriod อยู่ ค่า WarningPeriodInDays ต้องเป็นค่าว่าง (null)

source: Document Settings
th_th: การตั้งค่าเอกสาร

source: Number of days since request
th_th: จำนวนวันนับตั้งแต่มีการร้องขอ

source: Pay information letter
th_th: จดหมายข้อมูลค่าตอบแทน

source: Integer value defining the minimum number of workers required in a population (All, Male, Female) to display average compensation values
th_th: ค่าจำนวนเต็มที่กำหนดจำนวนพนักงานขั้นต่ำที่ต้องมีในกลุ่ม (ทั้งหมด, ชาย, หญิง) เพื่อให้แสดงค่าเฉลี่ยค่าตอบแทนได้

source: Population threshold
th_th: เกณฑ์ประชากรขั้นต่ำ

source: Request creation options
th_th: ตัวเลือกการสร้างคำขอ

source: Edit communication round
th_th: แก้ไขรอบการสื่อสาร

source: View communication round
th_th: ดูรอบการสื่อสาร

source: Communication
th_th: การสื่อสาร

source: Add mapping
th_th: เพิ่มการแม็ป

source: Mapping configuration
th_th: การกำหนดค่าการแมป

source: Data source
th_th: แหล่งข้อมูล

source: Template
th_th: เทมเพลต

source: Bulk generation
th_th: การสร้างจำนวนมาก

source: Individual PIR
th_th: PIR รายบุคคล

source: Document status and action log monitoring
th_th: การตรวจสอบสถานะเอกสารและบันทึกการดำเนินการ

source: Link one or several comp rounds to the communication round
th_th: เชื่อมโยงรอบการจ่ายผลตอบแทนหนึ่งหรือหลายรอบกับรอบการสื่อสาร

source: Comp round
th_th: รอบการจ่ายผลตอบแทน

source: Upload HRBP security mapping
th_th: อัปโหลดแผนที่ความปลอดภัย HRBP

source: HRBP security
th_th: ความปลอดภัยของ HRBP

source: Define the target populations for the round
th_th: กำหนดประชากรเป้าหมายสำหรับรอบ

source: Add document
th_th: เพิ่มเอกสาร

source: Create document
th_th: สร้างเอกสาร

source: Shared documents with selected populations
th_th: เอกสารที่แชร์กับกลุ่มประชากรที่เลือก

source: Documents can only be added once the communication round has been published.
th_th: สามารถเพิ่มเอกสารได้ก็ต่อเมื่อรอบการสื่อสารได้รับการเผยแพร่แล้วเท่านั้น

source: Documents can be added after publishing
th_th: สามารถเพิ่มเอกสารได้หลังจากเผยแพร่

source: Import PDF documents
th_th: นำเข้าเอกสาร PDF

source: No imported PDF documents yet!
th_th: ยังไม่มีเอกสาร PDF ที่นำเข้า!

source: Set the workflow of the communication round
th_th: กำหนดเวิร์กโฟลว์ของรอบการสื่อสาร

source: Audience
th_th: ผู้ชม

source: Search by worker
th_th: ค้นหาตามพนักงาน

source: Supported file formats: PDF. Maximum file size: 10MB. Maximum amount of files per upload: 1 file.
th_th: รูปแบบไฟล์ที่รองรับ: PDF ขนาดไฟล์สูงสุด: 10MB จำนวนไฟล์สูงสุดต่อการอัปโหลด: 1 ไฟล์

source: You can close this window, but please keep the page open to ensure a successful upload.
th_th: คุณสามารถปิดหน้าต่างนี้ได้ แต่กรุณาเปิดหน้านี้ทิ้งไว้เพื่อให้การอัปโหลดสำเร็จ

source: The document "{{fileName}}" cannot be imported. Check the format and size conditions.
th_th: ไม่สามารถนำเข้าเอกสาร "{{fileName}}" ได้ กรุณาตรวจสอบเงื่อนไขรูปแบบและขนาดของไฟล์

source: The code must be unique to publish the communication round. Please change the code and try again.
th_th: รหัสต้องไม่ซ้ำกันเพื่อเผยแพรรอบการสื่อสาร กรุณาเปลี่ยนรหัสและลองใหม่อีกครั้ง

source: Communication round details
th_th: รายละเอียดรอบการสื่อสาร

source: Round visibility
th_th: การมองเห็นของรอบ

source: Communication round owners
th_th: เจ้าของรอบการสื่อสาร

source: This communication round code is already in use. Please enter a unique value.
th_th: รหัสรอบการสื่อสารนี้ถูกใช้งานไปแล้ว โปรดป้อนค่าใหม่ที่ไม่ซ้ำกับของเดิม

source: The communication round code cannot be empty.
th_th: รหัสรอบการสื่อสารต้องไม่เว้นว่าง

source: Turn this setting on to add summary documents for communication managers.
th_th: เปิดการตั้งค่านี้เพื่อเพิ่มเอกสารสรุปสำหรับผู้จัดการฝ่ายสื่อสาร

source: Include summary documents
th_th: รวมเอกสารสรุป

source: The communication round name cannot be empty.
th_th: ชื่อรอบการสื่อสารต้องไม่เว้นว่าง

source: The visibility end date cannot be empty.
th_th: วันที่สิ้นสุดการแสดงผลต้องไม่เว้นว่าง

source: The visibility start date cannot be empty.
th_th: วันที่เริ่มต้นการแสดงผลต้องไม่เว้นว่าง

source: Are you sure you want to publish this communication round? Once published, the status of the round will be changed to "Open" and cannot be reverted to "Draft".
th_th: คุณแน่ใจหรือไม่ว่าต้องการเผยแพร่รอบการสื่อสารนี้ เมื่อเผยแพร่แล้ว สถานะของรอบจะเปลี่ยนเป็น "เปิด" และไม่สามารถเปลี่ยนกลับเป็น "แบบร่าง" ได้

source: Publish communication round
th_th: เผยแพรรอบการสื่อสาร

source: The communication round was successfully published.
th_th: เผยแพร่รอบการสื่อสารเรียบร้อยแล้ว

source: The communication round was successfully saved.
th_th: บันทึกรอบการสื่อสารเรียบร้อยแล้ว

source: Are you sure you want to save the changes to this published communication round? The round will be updated for all participants.
th_th: คุณแน่ใจหรือไม่ว่าต้องการบันทึกการเปลี่ยนแปลงในรอบการสื่อสารที่เผยแพร่นี้? รอบนี้จะถูกอัปเดตสำหรับผู้เข้าร่วมทุกคน

source: Update published round
th_th: อัปเดตรอบการเผยแพร่

source: The round was successfully updated.
th_th: อัปเดตรอบเรียบร้อยแล้ว

source: Round visibility end date
th_th: วันสิ้นสุดการมองเห็นของรอบ

source: Round visibility start date
th_th: วันที่เริ่มมองเห็นของรอบ

source: Configure approval milestones for the communication round
th_th: กำหนดค่าเหตุการณ์สำคัญการอนุมัติสำหรับรอบการสื่อสาร

source: Turn this setting on to add steps to the communication round workflow
th_th: เปิดการตั้งค่านี้เพื่อเพิ่มขั้นตอนในการสื่อสารรอบเวิร์กโฟลว์

source: Enable workflow steps
th_th: เปิดใช้งานขั้นตอนของเวิร์กโฟลว์

source: No communication rounds yet
th_th: ยังไม่มีรอบการสื่อสาร

source: Create and manage communication rounds
th_th: สร้างและจัดการรอบการสื่อสาร

source: Export recipient details
th_th: ส่งออกข้อมูลผู้รับ

source: Document
th_th: เอกสาร

source: Number of recipients
th_th: จำนวนผู้รับ

source: Added by
th_th: เพิ่มโดย

source: Create and manage communication rounds.
th_th: สร้างและจัดการรอบการสื่อสาร

source: Your communication rounds will appear here. Check again later for updates or explore more features in the meantime.
th_th: รอบการสื่อสารของคุณจะแสดงที่นี่ กรุณาตรวจสอบอีกครั้งในภายหลังเพื่อดูการอัปเดต หรือสำรวจฟีเจอร์เพิ่มเติมระหว่างนี้

source: Archived
th_th: เก็บถาวร

source: Comm rounds
th_th: รอบการสื่อสาร

source: You are about to publish the pending draft which will replace the currently published version of this comp round. Do you want to keep the manager entries?
th_th: คุณกำลังจะเผยแพร่ร่างที่รอดำเนินการ ซึ่งจะแทนที่เวอร์ชันที่เผยแพร่อยู่ของรอบการแข่งขันนี้ คุณต้องการเก็บรายการผู้จัดการไว้หรือไม่?

source: No, delete them
th_th: ไม่ ให้ลบออก

source: Publish updated comp round
th_th: เผยแพร่รอบการประเมินค่าตอบแทนที่อัปเดต

source: The workflow was updated; all workers in this round will reset to the first step.
th_th: เวิร์กโฟลว์ได้รับการอัปเดตแล้ว; คนงานทั้งหมดในรอบนี้จะถูกเริ่มใหม่ที่ขั้นตอนแรก

source: Yes, keep entries
th_th: ใช่ เก็บรายการไว้

source: View configuration
th_th: ดูการกำหนดค่า

source: Change source
th_th: เปลี่ยนแหล่งที่มา

source: Changing the proposal management source will clear the values you have entered. This action cannot be undone.
th_th: การเปลี่ยนแหล่งที่มาของการจัดการข้อเสนอจะล้างค่าที่คุณได้ป้อนไว้ การดำเนินการนี้ไม่สามารถย้อนกลับได้

source: Change proposal management source
th_th: เปลี่ยนแหล่งที่มาของการจัดการข้อเสนอ

source: Configure how proposal values are prepopulated and managed for each compensation element in this round.
th_th: กำหนดวิธีการเติมค่าเสนอให้อัตโนมัติและการจัดการสำหรับองค์ประกอบค่าตอบแทนแต่ละรายการในรอบนี้

source: Disabling the proposal management source will clear the values you have entered. This action cannot be undone.
th_th: การปิดแหล่งที่มาของการจัดการข้อเสนอจะล้างค่าที่คุณได้ป้อนไว้ การดำเนินการนี้ไม่สามารถย้อนกลับได้

source: Disable proposal management
th_th: ปิดใช้งานการจัดการข้อเสนอ

source: Enable proposal management
th_th: เปิดใช้งานการจัดการข้อเสนอ

source: Create your formula
th_th: สร้างสูตรของคุณ

source: Formula type
th_th: ประเภทสูตร

source: Use an existing value
th_th: ใช้ค่าเดิมที่มีอยู่

source: Prefill the proposal using an existing calculated or reference field
th_th: กรอกข้อเสนอไว้ล่วงหน้าโดยใช้ฟิลด์ที่คำนวณไว้แล้วหรือฟิลด์อ้างอิงที่มีอยู่

source: Calculate using a formula
th_th: คำนวณโดยใช้สูตร

source: Generate the proposal value using a custom formula
th_th: สร้างค่าในการเสนอโดยใช้สูตรกำหนดเอง

source: Proposal method
th_th: วิธีการนำเสนอข้อเสนอ

source: Choose an option to continue
th_th: เลือกตัวเลือกเพื่อดำเนินการต่อ

source: Source field
th_th: ฟิลด์ต้นทาง

source: This value will be used as the initial proposal for managers.
th_th: ค่านี้จะถูกใช้เป็นข้อเสนอเริ่มต้นสำหรับผู้จัดการ

source: Select the field used to prefill the proposal
th_th: เลือกฟิลด์ที่จะใช้ในการกรอกข้อเสนอล่วงหน้า

source: Choose one
th_th: เลือกหนึ่งรายการ

source: The source field is required.
th_th: ต้องระบุฟิลด์แหล่งที่มา

source: Workers manually removed
th_th: พนักงานถูกลบออกด้วยตนเอง

source: Workers manually added
th_th: พนักงานถูกเพิ่มด้วยตนเอง

source: Manage workers
th_th: จัดการพนักงาน

source: {{count}} worker selected
th_th: เลือกคนงานแล้ว {{count}} คน

source: {{count}} workers selected
th_th: เลือกคนงานแล้ว {{count}} คน

source: Exclude worker
th_th: ยกเว้นพนักงาน

source: Exclude selected
th_th: ยกเว้นที่เลือกไว้

source: Select which workers will be excluded from this compensation population.
th_th: เลือกว่าพนักงานคนใดจะถูกยกเว้นจากกลุ่มการชดเชยนี้

source: Include worker
th_th: รวมพนักงาน

source: Include selected
th_th: รวมที่เลือกไว้

source: Select which workers will be included in this compensation population.
th_th: เลือกพนักงานที่จะถูกรวมอยู่ในกลุ่มการชดเชยนี้

source: Please select at least one worker.
th_th: โปรดเลือกพนักงานอย่างน้อยหนึ่งคน

source: The population cannot be empty.
th_th: ไม่สามารถปล่อยให้ช่องจำนวนประชากรว่างได้

source: Individual inclusions and exclusions.
th_th: การรวมและการยกเว้นเป็นรายบุคคล

source: Select the relevant existing population criteria that apply to this round of compensation.
th_th: เลือกเกณฑ์ประชากรที่มีอยู่ที่เกี่ยวข้องซึ่งใช้กับรอบผลตอบแทนนี้

source: Populations relevant for this compensation round.
th_th: ประชากรที่เกี่ยวข้องสำหรับรอบการชดเชยนี้

source: Select system populations
th_th: เลือกประชากรระบบ

source: Selected populations
th_th: ประชากรที่เลือก

source: Overview of population definition.
th_th: ภาพรวมของการกำหนดประชากร

source: Compensation population summary
th_th: สรุปประชากรผลตอบแทน

source: Bonus STI
th_th: โบนัส STI

source: Workers can belong to multiple populations
th_th: พนักงานสามารถเป็นสมาชิกของกลุ่มประชากรได้หลายกลุ่ม

source: No compensation rounds created yet.
th_th: ยังไม่มีการสร้างรอบการชดเชย

source: No compensation rounds
th_th: ไม่มีรอบการชดเชย

source: Name (A-Z)
th_th: ชื่อ (A-Z)

source: Name (Z-A)
th_th: ชื่อ (Z-A)

source: Sort by
th_th: จัดเรียงตาม

source: End date (earliest)
th_th: วันที่สิ้นสุด (เร็วที่สุด)

source: End date (latest)
th_th: วันที่สิ้นสุด (ล่าสุด)

source: Last generated (oldest)
th_th: สร้างล่าสุด (เก่าที่สุด)

source: Last generated (newest)
th_th: สร้างล่าสุด (ใหม่ที่สุด)

source: Last edited (oldest)
th_th: แก้ไขล่าสุด (เก่าสุด)

source: Last edited (newest)
th_th: แก้ไขล่าสุด (ใหม่ที่สุด)

source: No actors selected
th_th: ไม่ได้เลือกนักแสดง

source: View bonus calculation formula configuration
th_th: ดูการกำหนดค่าสูตรคำนวณโบนัส

source: No guideline rules
th_th: ไม่มีหลักเกณฑ์แนวทาง

source: Start: {{startDate}} • End: {{endDate}}
th_th: เริ่ม: {{startDate}} • สิ้นสุด: {{endDate}}

source: Last updates
th_th: อัปเดตล่าสุด

source: Any changes to this round will appear here.
th_th: การเปลี่ยนแปลงใด ๆ สำหรับรอบนี้จะแสดงที่นี่

source: No updates yet
th_th: ยังไม่มีการอัปเดต

source: By {{author}},
th_th: โดย {{author}}

source: Added fields
th_th: เพิ่มฟิลด์แล้ว

source: Description:
th_th: คำอธิบาย:

source: Model name:
th_th: ชื่อรุ่น:

source: Updates have been made to the selected bonus plan. Use the pending draft version to apply them as needed.
th_th: มีการอัปเดตแผนโบนัสที่เลือกแล้ว โปรดใช้ร่างที่กำลังรอดำเนินการเพื่อปรับใช้การเปลี่ยนแปลงตามต้องการ

source: Updates have been made to the selected data model. Use the pending draft version to apply them as needed.
th_th: มีการอัปเดตใน data model ที่เลือกไว้แล้ว โปรดใช้เวอร์ชันฉบับร่างที่รอดำเนินการเพื่อปรับใช้การเปลี่ยนแปลงตามที่ต้องการ

source: The data model was extended with new fields. Use the pending draft version to apply them if needed.
th_th: โมเดลข้อมูลถูกขยายด้วยฟิลด์ใหม่ หากจำเป็นให้ใช้เวอร์ชันร่างที่รอดำเนินการเพื่อใช้การเปลี่ยนแปลงเหล่านี้

source: Updates have been made to the selected bonus plan. To apply the changes, please publish the compensation round.
th_th: มีการอัปเดตแผนโบนัสที่เลือกแล้ว หากต้องการนำการเปลี่ยนแปลงไปใช้ โปรดเผยแพรรอบการชดเชย

source: Republished (proposals retained)
th_th: เผยแพร่ซ้ำ (คงไว้ซึ่งข้อเสนอ)

source: Republished (no proposals)
th_th: เผยแพร่อีกครั้ง (ไม่มีข้อเสนอ)

source: Changes detected in bonus plan
th_th: ตรวจพบการเปลี่ยนแปลงในแผนโบนัส

source: Data model extended
th_th: ขยายโมเดลข้อมูลแล้ว

source: Pending draft created
th_th: สร้างฉบับร่างที่รอดำเนินการแล้ว

source: Pending draft deleted
th_th: แบบร่างที่รอดำเนินการถูกลบแล้ว

source: Round republished
th_th: รอบถูกเผยแพร่อีกครั้ง

source: Round published
th_th: รอบเผยแพร่แล้ว

source: View all updates
th_th: ดูการอัปเดตทั้งหมด

source: All updates
th_th: การอัปเดตทั้งหมด

source: View population configuration
th_th: ดูการกำหนดค่ากลุ่มเป้าหมาย

source: View round configuration
th_th: ดูการกำหนดค่ารอบ

source: Enabled
th_th: เปิดใช้งาน

source: Active rules: {{activeRulesCount}} • Inactive rules: {{inactiveRulesCount}}
th_th: กฎที่ใช้งานอยู่: {{activeRulesCount}} • กฎที่ไม่ได้ใช้งาน: {{inactiveRulesCount}}

source: Team planner configuration
th_th: การกำหนดค่าตัววางแผนทีม

source: View team planner configuration
th_th: ดูการกำหนดค่าเครื่องมือวางแผนทีม

source: Validation reports: {{validationReportsCount}}
th_th: รายงานการตรวจสอบความถูกต้อง: {{validationReportsCount}}

source: View workflow configuration
th_th: ดูการกำหนดค่าเวิร์กโฟลว์

source: API connection
th_th: การเชื่อมต่อ API

source: Connection details
th_th: รายละเอียดการเชื่อมต่อ

source: This download is unavailable because the data drop exceeds the {{workersCount}} worker limit. To fix this, please edit the configuration to narrow your worker selection. For help or to discuss options for large exports, please contact customer support.
th_th: ไม่สามารถดาวน์โหลดได้เนื่องจากข้อมูลที่ต้องการดาวน์โหลดเกินขีดจำกัดของ {{workersCount}} คนงาน หากต้องการแก้ไข โปรดแก้ไขการตั้งค่าเพื่อจำกัดการเลือกคนงานของท่าน หากต้องการความช่วยเหลือหรือปรึกษาทางเลือกสำหรับการส่งออกข้อมูลขนาดใหญ่ กรุณาติดต่อฝ่ายบริการลูกค้า
